---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.Generic
source: html/325219c4-7ca3-008a-5630-7bf2538c261a.htm
---
# Generic Properties

The property labeled "Color By Object" from the "Generic" schema.